/**
 * 日志数据
 version: 版本号
 date: 日期
 updates: 更新内容,为特定词条添加[[]]可以自动创建跳转链接
 */
const logData = [
    {
        version: 'V1.3.7',
        date: '2026-02-14',
        updates: [
            '【修复】打开百宝扫皮肤时贴图消失的问题',
            '【加强】千机伞，现在千机伞攻击带有高贵的真伤',
            '【修复】老麦的暗影小人不会识别四种仙草的问题',
            '【修复】饭桌，重启服务器展示的食物贴图丢失的问题',
            '【修复】太阳雕像召唤双子魔焰时打包太阳雕像boss会锁死无法召唤的问题',
            '【兼容】种子翻译可以查看起源种子的问题',
            '【修复】百宝会收集铺鸟陷阱、冰眼结晶器的眼球等类似容器的东西，现在不再收集',
            '【优化】百宝现在不会吸饭桶丢出来的食材',
            '【优化】白熊冰箱新增两个按钮：整理、合并（合并为收集半径3格范围内其他白熊冰箱里的食材），另新增微弱发光',
            '【修复】巧克力的buff和棱镜一起开启时，吃素buff偶尔失效的问题',
            '【新增】混沌物品：[[千机伞]]混沌（高贵的真伤+百分比伤害，Boss血量越高伤害越高）、月之魔典混沌（读书召唤月黑）、园艺学简编混沌（催生不影响巨大化、无数量限制、可催熟起源琉璃树结果）、亮茄炸弹混沌（轮椅武器）、羽扇混沌（可刮出两道旋风，后续将增加mod配置调节旋风数量）。混沌水晶可混沌的物品将陆续增加',
            '【优化】月食雕像献祭逻辑'
        ]
    },
    {
        version: 'V1.3.6',
        date: '2026-01-25',
        updates: [
            '【修复】打开百宝时扫皮肤会出现贴图丢失的问题',
            '【联动】现在混沌水晶可以对丰耘秘境的自然亲和子塔和辉煌多用工具使用使其变成无限耐久'
        ]
    },
    {
        version: 'V1.3.5',
        date: '2026-01-24',
        updates: [
            '【优化】优化千机伞手感',
            '【修复】修复百宝饭桶食材查找逻辑,不允许在容器中查找背包除外',
            '【优化】优化解密后的星空标签页分类',
            '【优化】优化灯光照范围加模组配置，雕像小地图图标',
            '【修复】修复解密星空与其他有旺达角色标签的人物冲突问题，之前只兼容了旺达现在兼容性更好。'
        ]
    },
    {
        version: 'V1.3.4',
        date: '2026-01-18',
        updates: [
            '【紧急修复】修复解密的星空会意外移除掉旺达的标签问题。导致旺达的表都不能用了'
        ]
    },
    {
        version: 'V1.3.3',
        date: '2026-01-16',
        updates: [
            '【新增】百宝包新增ui',
            '【优化】玉食盒和星翼不能和其他容器同时打开的问题',
            '【优化】种子翻译',
            '【优化】禁用催生后不禁用自动对话',
            '【统一】法杖施法方式改成一样的',
            '【修复】修复小恶魔的手持法杖无法跳越的bug（给科雷修修腿）'
        ]
    },
    {
        version: 'V1.3.2',
        date: '2026-01-10',
        updates: [
            '【修复】修复开启五个后百宝背包再重新穿戴护甲的时候背后贴图消失的问题',
            '【新增】封印法杖2现在可以摧毁天体死后掉落的几个贡品，避免在太阳雕像重复刷天体boss时地贡品过多强迫症福利，敲掉一个返还10个月岩',
            '【新增】封印法杖2可以摧毁犀牛箱子，箱子物品掉落并额外给5个铥矿'
        ]
    },
    {
        version: 'V1.3.1',
        date: '2026-01-09',
        updates: [
            '【修复】修复编制者草图能召唤疯猪的问题，应是没有任何反应',
            '【修复】修复使用混沌水晶后的紫水晶剑电击失效的问题',
            '【修复】修复若紫水晶刀耐久为0使用混沌水晶后伤害未恢复的问题'
        ]
    },
    {
        version: 'V1.3.0',
        date: '2026-01-08',
        updates: [
            '【修复】修复星翼宣告问题',
            '【修复】修复背包兼容其他五格的问题',
            '【修复】修复快捷键切换封印法杖2锤子状态偶尔失效的问题',
            '【修复】修复重新加载封印法杖2锤子状态未保存的问题',
            '【更新】更新百宝控制按钮的字符提示',
            '【修改】修改去掉腐烂箱的小地图图标',
            '【修复】修复饭桶自动入锅时由于怪物肉和藤壶有selfstacker组件导入如果混乱的问题'
        ]
    },
    {
        version: 'V1.2.29',
        date: '2025-01-01',
        updates: [
            '【修复】修复咖啡移速设定不符的问题',
            '【修复】修复通过太阳雕像制造的百宝无法放置的问题',
            '【修复】兼容背包和常用的五格模组的问题'
        ]
    },
    {
        version: 'V1.2.28',
        date: '2025-01-31',
        updates: [
            '【修复】属于太阳雕像科技的物品在其他分类栏处于解锁状态的问题'
        ]
    },
    {
        version: 'V1.2.27',
        date: '2025-12-30',
        updates: [
            '【新增】[[百宝灯]]',
            '【新增】[[展示柜]]',
            '【新增】[[饭桌]]',
            '【新增】[[神秘腐烂箱]]',
            '【新增】[[百宝炊具]]',
            '【新增】[[月食雕像仿品]]',
            '【新增】[[月食雕像珍品]]地形',
            '【新增】[[太阳雕像仿品]]',
            '【新增】[[太阳雕像珍品]]地形',
            '【新增】工具[[百宝花杖]]',
            '【新增】解密后的[[星空]]',
            '【新增】材料[[星空宝石]]',
            '【新增】材料[[混沌水晶]]',
            '【新增】材料[[月食遗物]]',
            '【新增】材料[[太阳火种]]',
            '【新增】背包：[[百宝背包]]',
            '【新增】mod配置中可以开启种子翻译可以看到，丰耘秘境和原版的真实的种子名字',
            '【新增】开启衣柜修改可以让衣柜储物',
            '【修复】兼容和最好的女武神冲突的问题',
            '【修复】修复其他角色吃熊猫粽子也会出现buff的问题'
        ]
    },
    {
        version: 'V1.2.26',
        date: '2025-12-08',
        updates: [
            '【新增】万物百宝箱 V2 绝望石解锁科技功能',
            '【新增】[[玉食盒]]支持反鲜功能',
            '【修复】修复了[[千机伞]]跳劈伤害异常的问题'
        ]
    }
];
