/**
 * 日志数据
 version: 版本号
 date: 日期
 updates: 更新内容,为特定词条添加[[]]可以自动创建跳转链接
 */
const logData = [
    {
        version: 'V1.3.2',
        date: '2026-01-10',
        updates: [
            '【修复】修复开启五个后百宝背包再重新穿戴护甲的时候背后贴图消失的问题',
            '【新增】封印法杖现在可以摧毁天体死后掉落的几个贡品，避免在太阳雕像重复刷天体boss时地贡品过多强迫症福利，敲掉一个返还10个月岩'
        ]
    },
    {
        version: 'V1.3.1',
        date: '2026-01-09',
        updates: [
            '【修复】修复编制者草图能召唤疯猪的问题，应是没有任何反应',
            '【修复】修复使用混沌水晶后的紫水晶剑电击失效的问题',
            '【修复】修复若紫水晶刀耐久为0使用混沌水晶后伤害未恢复的问题'
        ]
    },
    {
        version: 'V1.3.0',
        date: '2026-01-08',
        updates: [
            '【修复】修复星翼宣告问题',
            '【修复】修复背包兼容其他五格的问题',
            '【修复】修复快捷键切换封印法杖2锤子状态偶尔失效的问题',
            '【修复】修复重新加载封印法杖2锤子状态未保存的问题',
            '【更新】更新百宝控制按钮的字符提示',
            '【修改】修改去掉腐烂箱的小地图图标',
            '【修复】修复饭桶自动入锅时由于怪物肉和藤壶有selfstacker组件导入如果混乱的问题'
        ]
    },
    {
        version: 'V1.2.29',
        date: '2025-01-01',
        updates: [
            '【修复】修复咖啡移速设定不符的问题',
            '【修复】修复通过太阳雕像制造的百宝无法放置的问题',
            '【修复】兼容背包和常用的五格模组的问题'
        ]
    },
    {
        version: 'V1.2.28',
        date: '2025-01-31',
        updates: [
            '【修复】属于太阳雕像科技的物品在其他分类栏处于解锁状态的问题'
        ]
    },
    {
        version: 'V1.2.27',
        date: '2025-12-30',
        updates: [
            '【新增】[[百宝灯]]',
            '【新增】[[展示柜]]',
            '【新增】[[饭桌]]',
            '【新增】[[神秘腐烂箱]]',
            '【新增】[[百宝炊具]]',
            '【新增】[[月食雕像仿品]]',
            '【新增】[[月食雕像珍品]]地形',
            '【新增】[[太阳雕像仿品]]',
            '【新增】[[太阳雕像珍品]]地形',
            '【新增】工具[[百宝花杖]]',
            '【新增】解密后的[[星空]]',
            '【新增】材料[[星空宝石]]',
            '【新增】材料[[混沌水晶]]',
            '【新增】材料[[月食遗物]]',
            '【新增】材料[[太阳火种]]',
            '【新增】背包：[[百宝背包]]',
            '【新增】mod配置中可以开启种子翻译可以看到，丰耘秘境和原版的真实的种子名字',
            '【新增】开启衣柜修改可以让衣柜储物',
            '【修复】兼容和最好的女武神冲突的问题',
            '【修复】修复其他角色吃熊猫粽子也会出现buff的问题'
        ]
    },
    {
        version: 'V1.2.26',
        date: '2025-12-08',
        updates: [
            '【新增】万物百宝箱 V2 绝望石解锁科技功能',
            '【新增】[[玉食盒]]支持反鲜功能',
            '【修复】修复了[[千机伞]]跳劈伤害异常的问题'
        ]
    }
];
